app/controllers/appointments_controller.rb

SELECT `appointments`.* FROM `appointments`
---
  def index
    @appointments = Appointment.all

SELECT `appointments`.* FROM `appointments` WHERE (appointment_day = 17 October, 1915)
---
  def new
    @appointment = Appointment.new
    @appointment_date = params[:selected_date].present? ? params[:selected_date] : Time.now.strftime("%d/%m/%Y")
    @date = DateTime.parse(@appointment_date).strftime("%Y-%m-%d")
    @appointments = Appointment.where("appointment_day = '#{@date}'")

INSERT INTO `appointments` (`appointment_day`, `time_slot`, `created_at`, `updated_at`) VALUES ('2017-03-10', '6:00 PM', '2017-03-10 07:03:57', '2017-03-10 07:03:57')
---
  def create
    @appointment = Appointment.new(appointment_params)
      if @appointment.save

SELECT  `appointments`.* FROM `appointments` WHERE `appointments`.`id` = 1 LIMIT 1
---
    def set_appointment
      @appointment = Appointment.find(params[:id])